app/controllers/avatars_controller.rb

SELECT "avatars".* FROM "avatars" WHERE (photo_id = 7)
---
  def index
    @avatars = Avatar.where("photo_id = ?", the_photo)

SELECT "avatars".* FROM "avatars" WHERE "avatars"."id" = ? LIMIT 1  [["id", "undefined"]]
---
  def show
    @avatar = Avatar.find(params[:id])

INSERT INTO "avatars" ("avatar_file", "created_at", "photo_id", "updated_at") VALUES (?, ?, ?, ?)  [["avatar_file", "04-olivia_ong-absolutely-_T.HDJAY.COM_.mp3"], ["created_at", Fri, 08 Jun 2012 05:49:19 UTC +00:00], ["photo_id", 1], ["updated_at", Fri, 08 Jun 2012 05:49:19 UTC +00:00]]
---
  def create
    #@photo = Photo.find(params["photo_id"])
    params[:avatar][:avatar_file].original_filename = "hellobietch.mp3"
    @avatar = @photo.avatars.new(params[:avatar])

    if @avatar.save

SELECT "avatars".* FROM "avatars" WHERE "avatars"."id" = ? LIMIT 1  [["id", "26"]]
DELETE FROM "avatars" WHERE "avatars"."id" = ?  [["id", 26]]
---
  def destroy
    @avatar = Avatar.find(params[:id])
    @avatar.destroy